package com.dy.dyapiinterface.utils;

import java.util.Random;

public class RandomNameGenerator {
    private static final String[] FIRST_NAMES = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "邓", "鲍", "史", "唐", "费", "廉"};
    private static final String[] LAST_NAMES = {"子轩", "思远", "思雨", "欣怡", "心怡", "思怡", "思琪", "思宇", "思婷", "晓倩", "晓燕", "晓琳", "晓娟", "晓丽", "思涵", "思琳", "思琦", "思颖", "思嘉", "思佳", "思敏", "思怡", "思慧", "思萱", "思娜", "思淼", "思珂", "思琪", "思婷", "思颖", "思琳", "思怡", "思茜", "思涵", "思婷", "晓丹", "晓娜", "晓霞", "晓燕", "晓莉", "晓琳", "晓倩", "晓丽", "晓芸", "晓艳", "晓婷","晓婷","雨婷", "雨萱", "雨娜", "雨薇", "雨桐", "雨琪", "雪婷", "雪萍", "雪莉", "雪梅", "雪娟", "雪琳", "雪婷", "雪芳", "雪莹", "雪丽", "雪霞", "雪洁", "雪慧", "雪媛", "雪娜", "雪琴", "雪玲", "雪菲", "雪妍", "雪倩", "雪婷", "雪娇", "雪怡", "雪婷", "雯琪", "雯雯", "雯婷", "雯丽", "雯娜", "雯玲", "雯婧", "雯洁", "雯莉", "雯媛", "雯萍", "雯菲", "雯芳", "雯霞", "雯燕","雯倩", "雯婕", "雯婵", "雯婷", "雨萍", "雨婷", "雨娟", "雨婷", "雨婷", "雨萱", "雨婷", "雨婷", "雨娜", "雨萍", "雨薇", "雨婷", "雨婷", "雨萱", "雪婷", "雪萍", "雪莉", "雪梅", "雪娟", "雪琳", "雪婷", "雪芳", "雪莹", "雪丽", "雪霞", "雪洁", "雪慧", "雪媛", "雪娜", "雪琴", "雪玲", "雪菲", "雪妍", "雪倩", "雪婷", "雪娇", "雪怡", "雪婷", "雨婷", "雨萱", "雨娜"};

    public static String generateName() {
        Random random = new Random();
        String firstName = FIRST_NAMES[random.nextInt(FIRST_NAMES.length)];
        String lastName = LAST_NAMES[random.nextInt(LAST_NAMES.length)];
        return firstName +  lastName;
    }

    public static void main(String[] args) {
        String s = generateName();
        System.out.println(s);
    }
}

